{
  "ProgrammingLanguages":
  [
    {"LanguagePopularity":"Difficult","LanguageID":1,"LanguageImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","LanguageName":"Java","LanguageSite":"https://www.hikingupward.com/snp/oldrag/", "LanguageDescription": "Old Rag Mountain Loop is a 9.5 mile heavily trafficked loop trail located near Etlan, Virginia that features a river and is rated as difficult. The trail is primarily used for hiking and is best used from May until October.", "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Difficult","LanguageID":2,"LanguageImage":"http://www.protogic.com/images/White_Oak.jpg","LanguageName":"Python","LanguageSite":"https://www.hikingupward.com/SNP/WhiteOakCedarRun/", "LanguageDescription": "White Oak Canyon Trail is a 9.5 mile heavily trafficked out and back trail located near Syria, Virginia that features a waterfall and is rated as difficult. The trail offers a number of activity options and is best used from March until November. Dogs are also able to use this trail but must be kept on leash.", "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Strenuous","LanguageID":3,"LanguageImage":"http://www.protogic.com/images/Strickler_Knob.jpg","LanguageName":"C++","LanguageSite":"https://www.hikingupward.com/GWNF/StricklerKnob/", "LanguageDescription": "Strickler Knob Trail is a 5.4 mile moderately trafficked out and back trail located near Luray, Virginia that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking and bird watching and is accessible year-round." , "LanguageSalary" : "90000" },
    {"LanguagePopularity":"Easy","LanguageID":4,"LaLanguageIDnguageImage":"http://www.protogic.com/images/Crabtree_Falls.jpg","LanguageName":"JavaScript","LanguageSite":"https://www.hikingupward.com/GWNF/CrabtreeFalls/", "LanguageDescription": "Crabtree Falls Trail is a 2.8 mile heavily trafficked out and back trail located near Tyro, Virginia that features a waterfall and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash." , "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Difficult","LanguageID":5,"LanguageImage":"http://www.protogic.com/images/Signal_Knob.jpg","LanguageName":"PHP","LanguageSite":"https://www.hikingupward.com/GWNF/SignalKnob/", "LanguageDescription": "Signal Knob Loop Trail is a 10 mile heavily trafficked loop trail located near Strasburg, Virginia that features beautiful wild flowers and is rated as difficult. The trail is primarily used for hiking, running, bird watching, and horses and is best used from April until November. Dogs are also able to use this trail but must be kept on leash." , "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Difficult","LanguageID":6,"LanguageImage":"http://www.protogic.com/images/Overall_Run.jpg","LanguageName":"MySQL","LanguageSite":"https://www.hikingupward.com/SNP/OverallRunBeecherRidge/", "LanguageDescription": "Overall Run and Beecher Ridge Trail is a 13.5 mile moderately trafficked loop trail located near Luray, Virginia that features a waterfall and is rated as difficult. The trail is primarily used for hiking, running, camping, and backpacking. Dogs are also able to use this trail but must be kept on leash." , "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Moderate","LanguageID":7,"LanguageImage":"http://www.protogic.com/images/Raven_Rocks.jpg","LanguageName":"C#","LanguageSite":"https://www.hikingupward.com/OVH/RavenRocks/", "LanguageDescription": "Raven Rocks via Appalachian Trail is a 5.7 mile heavily trafficked out and back trail located near Bluemont, Virginia that features a river and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash." , "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Moderate​","LanguageID":8,"LanguageImage":"http://www.protogic.com/images/Little_Devis.jpg","LanguageName":"R","LanguageSite":"https://www.hikingupward.com/SNP/LittleDevilsStairs/", "LanguageDescription": "Little Devils Stairs Trail is a 5.6 mile heavily trafficked loop trail located near Sperryville, Virginia that features a waterfall and is rated as moderate. The trail is primarily used for hiking and is best used from April until November. Dogs are also able to use this trail but must be kept on leash." , "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Easy","LanguageID":9,"LanguageImage":"http://www.protogic.com/images/Big_Schloss.jpg","LanguageName":"HTML","LanguageSite":"https://www.hikingupward.com/GWNF/BigSchloss/", "LanguageDescription": "Big Schloss Loop is a 12.2 mile loop trail located near Star Tannery, Virginia that features a great forest setting. The trail is rated as moderate and is primarily used for hiking, walking, trail running, and nature trips. Dogs are also able to use this trail but must be kept on leash.", "LanguageSalary" : "90000"},
    {"LanguagePopularity":"Strenuous","LanguageID":10,"LanguageImage":"http://www.protogic.com/images/Three_Ridges.jpg","LanguageName":"CSS","LanguageSite":"https://www.hikingupward.com/GWNF/ThreeRidges/", "LanguageDescription": "Harpers Creek Shelter via Appalachian Trail is a 5.1 mile lightly trafficked out and back trail located near Tyro, Virginia that offers the chance to see wildlife. The trail is rated as difficult and is primarily used for hiking and running.", "LanguageSalary" : "90000"}
  ]
  "Status":"OK"
}
